app/controllers/pages_controller.rb

  def delete
    User.destroy(params[:id].to_i)
---
DELETE FROM `users` WHERE `users`.`id` = 1

  def index
    @users = User.all()
---
SELECT `users`.* FROM `users`