app/controllers/sessions_controller.rb

  def create
    @user = User.find_or_create_from_auth_hash(auth_hash)
---
INSERT INTO `users` (`provider`, `uid`, `created_at`, `updated_at`) VALUES ('twitter', '953343996121747456', '2018-01-17 12:05:10', '2018-01-17 12:05:10')